In [1]:
import pandas as pd

In [2]:
dict1={'Name':['ABC','BCD','CDE','DEF','EFG','FGI','GHI'],
      'Marks':[99,98,95,96,99,89,95],
      'Gender':['Male','FeMale','FeMale','Male','FeMale','Male','FeMale']}
      
df1=pd.DataFrame(dict1)
df1

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [3]:
df1.head(3)

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale

In [4]:
df1.tail(3)

  Name  Marks  Gender
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [5]:
df1.shape

(7, 3)

In [6]:
print('Number of rows',df1.shape[0])
print('Number of coloumns',df1.shape[1])

Number of rows 7
Number of coloumns 3

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [8]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [9]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [10]:
df1.Marks.sum()

671

In [11]:
df1.Gender.sum()

'MaleFeMaleFeMaleMaleFeMaleMaleFeMale'

In [12]:
df1.Name.sum()

'ABCBCDCDEDEFEFGFGIGHI'

In [13]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
df1.describe()

           Marks
count   7.000000
mean   95.857143
std     3.484660
min    89.000000
25%    95.000000
50%    96.000000
75%    98.500000
max    99.000000

In [15]:
df1.describe(include='all')

       Name      Marks  Gender
count     7   7.000000       7
unique    7        NaN       2
top     CDE        NaN  FeMale
freq      1        NaN       4
mean    NaN  95.857143     NaN
std     NaN   3.484660     NaN
min     NaN  89.000000     NaN
25%     NaN  95.000000     NaN
50%     NaN  96.000000     NaN
75%     NaN  98.500000     NaN
max     NaN  99.000000     NaN

In [16]:
df1['Gender'].unique()

array(['Male', 'FeMale'], dtype=object)

In [17]:
df1['Marks'].unique()

array([99, 98, 95, 96, 89], dtype=int64)

In [18]:
df1['Name'].unique()

array(['ABC', 'BCD', 'CDE', 'DEF', 'EFG', 'FGI', 'GHI'], dtype=object)

In [19]:
df1['Gender'].nunique()

2

In [20]:
df1['Marks'].nunique()

5

In [21]:
df1['Gender'].value_counts()

FeMale    4
Male      3
Name: Gender, dtype: int64

In [22]:
df1['Marks']>=90

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: Marks, dtype: bool

In [23]:
df1[df1['Marks']>95]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
3  DEF     96    Male
4  EFG     99  FeMale

In [24]:
df1[(df1['Marks']>95) & (df1['Marks']<100)]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
3  DEF     96    Male
4  EFG     99  FeMale

In [25]:
df1[(df1['Marks']>95) | (df1['Marks']<100)]

  Name  Marks  Gender
0  ABC     99    Male
1  BCD     98  FeMale
2  CDE     95  FeMale
3  DEF     96    Male
4  EFG     99  FeMale
5  FGI     89    Male
6  GHI     95  FeMale

In [36]:
len(df1[(df1['Marks']>=95) & (df1['Marks']<100)])

6

In [34]:
df1['Marks'].between(95,100)

0     True
1     True
2     True
3     True
4     True
5    False
6     True
Name: Marks, dtype: bool

In [35]:
sum(df1['Marks'].between(95,100))

6

In [37]:
df1['Marks'].mean()

95.85714285714286

In [38]:
df1['Marks'].min()

89

In [39]:
df1['Marks'].max()

99